In [3]:
lst = [[1]*(i+1) for i in range(5)]
lst

[[1], [1, 1], [1, 1, 1], [1, 1, 1, 1], [1, 1, 1, 1, 1]]

In [17]:
import pandas as pd
import numpy as np
x = np.random.random((5,5))

In [19]:
colnames = ["col"+str(i) for i in range(5)]
df = pd.DataFrame(x, columns=colnames)
display(df)
print(type(df))

       col0      col1      col2      col3      col4
0  0.381356  0.948165  0.083552  0.208257  0.516020
1  0.145749  0.104098  0.300087  0.398263  0.660491
2  0.168878  0.738567  0.123160  0.881641  0.262279
3  0.001832  0.660509  0.867112  0.534126  0.163382
4  0.767650  0.583775  0.646304  0.777617  0.873298

<class 'pandas.core.frame.DataFrame'>

In [30]:
c = df["col2"]
print(c)
print(type(c))
print(c[2])

0    0.083552
1    0.300087
2    0.123160
3    0.867112
4    0.646304
Name: col2, dtype: float64
<class 'pandas.core.series.Series'>
0.12316001093164863

In [42]:
display(df)
df2 = df[["col0","col1"]]
display(df2)

       col0      col1      col2      col3      col4
0  0.381356  0.948165  0.083552  0.208257  0.516020
1  0.145749  0.104098  0.300087  0.398263  0.660491
2  0.168878  0.738567  0.123160  0.881641  0.262279
3  0.001832  0.660509  0.867112  0.534126  0.163382
4  0.767650  0.583775  0.646304  0.777617  0.873298

       col0      col1
0  0.381356  0.948165
1  0.145749  0.104098
2  0.168878  0.738567
3  0.001832  0.660509
4  0.767650  0.583775

In [48]:
# Acces to row by index with iloc
df2t = df2.T
print(df2t)

df2t.iloc[0]

             0         1         2         3         4
col0  0.381356  0.145749  0.168878  0.001832  0.767650
col1  0.948165  0.104098  0.738567  0.660509  0.583775

0    0.381356
1    0.145749
2    0.168878
3    0.001832
4    0.767650
Name: col0, dtype: float64

In [55]:
# Acces to row by name with loc
df2t = df2.T
print(df2t)

df2t.loc["col1"] # return series
#df2t.loc[["col1","col0"]] # return df

             0         1         2         3         4
col0  0.381356  0.145749  0.168878  0.001832  0.767650
col1  0.948165  0.104098  0.738567  0.660509  0.583775

0    0.948165
1    0.104098
2    0.738567
3    0.660509
4    0.583775
Name: col1, dtype: float64

In [62]:
data = [
    {"name":"Pension Pepe", "stars":3, "precionoche":20},
    {"name":"Wellington", "stars":5, "precionoche":300},
    {"name":"Velazquez", "stars":5, "precionoche":190},
    {"name":"Pension Loli", "stars":1, "precionoche":4.5}
]

print(data)

df = pd.DataFrame(data)
df

[{'name': 'Pension Pepe', 'stars': 3, 'precionoche': 20}, {'name': 'Wellington', 'stars': 5, 'precionoche': 300}, {'name': 'Velazquez', 'stars': 5, 'precionoche': 190}, {'name': 'Pension Loli', 'stars': 1, 'precionoche': 4.5}]

           name  precionoche  stars
0  Pension Pepe         20.0      3
1    Wellington        300.0      5
2     Velazquez        190.0      5
3  Pension Loli          4.5      1

In [74]:
piscina = [True,False,True,False]

df["piscina"] = piscina
df = df[["name","precionoche","piscina","stars"]]
df

           name  precionoche  piscina  stars
0  Pension Pepe         20.0     True      3
1    Wellington        300.0    False      5
2     Velazquez        190.0     True      5
3  Pension Loli          4.5    False      1

In [77]:
df["preciodescuento"] = df["precionoche"] * 0.8
df

           name  precionoche  piscina  stars  preciodescuento
0  Pension Pepe         20.0     True      3             16.0
1    Wellington        300.0    False      5            240.0
2     Velazquez        190.0     True      5            152.0
3  Pension Loli          4.5    False      1              3.6

In [80]:
df["precio3"] = [e*0.8 for e in df["precionoche"]]

In [81]:
df

           name  precionoche  piscina  stars  preciodescuento  precio3
0  Pension Pepe         20.0     True      3             16.0     16.0
1    Wellington        300.0    False      5            240.0    240.0
2     Velazquez        190.0     True      5            152.0    152.0
3  Pension Loli          4.5    False      1              3.6      3.6

In [87]:
colsnew = [col for col in df.columns  if col != "preciodescuento"]
df = df[colsnew]

In [88]:
df

           name  precionoche  piscina  stars  precio3
0  Pension Pepe         20.0     True      3     16.0
1    Wellington        300.0    False      5    240.0
2     Velazquez        190.0     True      5    152.0
3  Pension Loli          4.5    False      1      3.6